module.exports = function (type) { 
    let array //Array variable

    if(type === 1){ //If type is 1
        array = [
            "https://youtu.be/Hy8kmNEo1i8",
            "https://youtu.be/t0I4mTEdAf8",
            "https://youtu.be/hJY5jgO6HAc",
            "https://youtu.be/UC5VRrrd-xU",
            "https://youtu.be/4jxc_jyLbCM",
            "https://youtu.be/po_FqB0ygUU",
            "https://youtu.be/RKW6rjnYEkc",
            "https://youtu.be/ZZ5LpwO-An4",
            "https://youtu.be/b1qRgrTAwqA",
            "https://youtu.be/WXWpl_MXpuE",
            "https://youtu.be/dkM9GxaCow4",
            "https://youtu.be/mnCUqMB88Ww",
            "https://youtu.be/E-xhxS581Uc",
            "https://youtu.be/J2aJlb-bmuM",
            "https://youtu.be/uVTTkexJNwI",
            "https://youtu.be/1wF-JvimAV0",
            "https://youtu.be/M9J6DKJXoKk",
            "https://youtu.be/AD33rb6CL2A",
            "https://youtu.be/K4dAkcp6zrE",
            "https://youtu.be/g4mHPeMGTJM"
        ]
    }
    else if(type === 2){
        array = [
            '**Упс! Ми вронили магічний шар!**',
            '**Чітке "Ні."**',
            '**Чітке "Так."**',
            '**В магічного шара є сумніви..**',
            '**Духи кажуть "Так.."**\nАле чи можна їм довіряти?',
            '**Духи кажуть "Так.."**\nАле чи можна їм довіряти?',
            '**404: Не знайдено**',
            '**Духи засмучені цим запитанням**',
            '**Духам подобається Ваше запитання**'
        ]
    }
    else if(type === 3){
        array = [
            'Половина населення Землі (а за деякими підрахунками навіть дві третини) ніколи не бачили снігу.',
            'Три найбагатші родини у світі мають більше активів, ніж 48 найбідніших країн.',
            'Кубик Рубіка – товар, який найбільше продається у світі. На другому місці – iPhone.',
            'Щоб передивитися всі відео на YouTube, знадобиться 1000 років.',
            'На шоломах астронавтів є спеціальний пристрій, щоб чухати носа.',
            'Половина всіх людей, які досягли 65-річного віку, за всю історію людства, все ще живі.',
            'Корови можуть ставати справжніми друзями і відчувають біль розлуки, якщо їх розлучають. Вони також розуміють, коли їх обзивають, і можуть плакати.',
            'Ймовірність стати президентом у кожної людини вища, ніж виграти в лотерею. До речі, померти на шляху до лотерейного квитка теж більш імовірно, ніж перемогти.',
            'В 1853 році у той час як весь світ рятувався від темряви свічками, в Україні у місті Львів вперше у світі засвітила гасова лампа.',
            'В місті Дніпро розташований один з найбільших заводів з виготовлення озброєння та космічної техніки. Саме тут було виготовлено перший в історії штучний супутник Землі, а його запуск вважається початком космічної ери.',
            'Авіаконструктор І.І. Сікорський розробив безліч нових моделей літаків, однією з його заслуг є також винахід гелікоптера',
            'В Дніпрі знаходиться одна з найдовших і найбільш мальовничих у світі набережних. Вона простяглася на 23 кілометри.',
            'Івано-Франківськ раніше носив назву Станіславів і був столицею Західно-Української Народної Республіки в 1919 році. Свою сучасну назву отримав у 1962 році на 300-річчя міста.',
            'Ми слухаємо Хейтспіча поки пишемо це.',
            'Наш сервер стоїть на болтах з будівельного магазину.',
            'Гороскоп на сьогодні рекомендує частіше визнавати свої помилки (Ми не віримо в гороскоп)',
            'Ми обожнюємо меми'
        ]
    }
    else{
        array = ['null']
    }
    return array[Math.floor(Math.random()*array.length)]; //Get random item from defined array
};